{
  "OnSpecificLocationDiscovered": {
    "Pelagia Farm": [
      "Ah yes, the thrill of... cabbage?",
      "You discovered Pelagia Farm. Slow down, adventurer."
    ],
    "Solitude Lighthouse": [
      "You found the lighthouse. Try not to fall off.",
      "Solitude Lighthouse: because someone has to keep ships from crashing."
    ],
    "Thalmor Embassy": [
      "Thalmor spotted. Better keep your mouth shut.",
      "You're not supposed to be here... are you?"
    ],
    "Clearpine Pond": [
      "It's a pond. It's clear. It's piney. Nature, wow.",
      "Discovered a pond. Good job, Dovah-fish."
    ],
    "Ragnvald": [
      "Home of restless draugr and bad decisions.",
      "You found Ragnvald! Now turn around and pretend you didn't."
    ],
    "The Guardian Stones": [
      "Choose your fate! Or just fast-travel away.",
      "Ah, Skyrim's starting zone... nostalgic, huh?"
    ],
    "Shor's Stone": [
      "A tiny town with big mining dreams.",
      "You found Shor’s Stone. Population: barely."
    ],
    "Glenmoril Coven": [
      "Witch central! Smells like alchemy and regret.",
      "Discovered Glenmoril Coven. Time to hex someone."
    ],
    "Honningbrew Meadery": [
      "Mead, mead, glorious mead!",
      "Found the meadery. Hope you brought a drinking horn."
    ],
    "Snapleg Cave": [
      "What a charming name. What could go wrong?",
      "Discovered Snapleg Cave. Try to keep yours intact."
    ],
    "Bilegulch Mine": [
      "You found Bilegulch Mine. Sounds... appetizing?",
      "Ore and orcs and ouch."
    ],
    "Embershard Mine": [
      "Classic starter dungeon. Feeling nostalgic?",
      "Ah, Embershard — the first cave every player clears accidentally."
    ],
    "College of Winterhold": [
      "School of magic or frostbite simulator?",
      "You discovered the College! Please don't blow it up."
    ],
    "Forelhost": ["Forelhost. For real ghosts.", "One word: Draugr."],
    "Castle Volkihar": [
      "You've reached vampire HQ. Bring garlic.",
      "Castle Volkihar — now featuring 80% more brooding."
    ],
    "Dawnstar": [
      "Sleepy coastal town. Emphasis on nightmares.",
      "Welcome to Dawnstar. Population: insomniacs."
    ],
    "The Throat of the World": [
      "Top of the world, Ma!",
      "Hope you brought a coat."
    ],
    "High Hrothgar": [
      "So many steps... so much wheezing.",
      "You met the Greybeards! No shouting indoors."
    ],
    "Riverwood": [
      "Where every journey begins — and chickens fear you.",
      "Riverwood: scenic, peaceful, terribly doomed if you sneeze."
    ],
    "Bleak Falls Barrow": [
      "You discovered the tutorial dungeon! Again.",
      "Guaranteed to have a claw puzzle and restless Draugr."
    ],
    "Labyrinthian": [
      "It's big. It's cold. It's full of regrets.",
      "You found Labyrinthian. Good luck finding the exit."
    ],
    "Fort Dawnguard": [
      "Home of the vampire hunters! And some questionable interior decorating.",
      "You discovered Fort Dawnguard. Now slay responsibly."
    ],
    "Windhelm": [
      "Welcome to Windhelm! Where it's always winter and never Christmas.",
      "You discovered Windhelm. The only place where hypothermia is considered a tourist attraction."
    ],
    "Whiterun": [
      "Ah, Whiterun. Home of overpriced houses and an unnecessary amount of stairs.",
      "You discovered Whiterun. Please don't climb the Dragonsreach walls again."
    ],
    "Riften": [
      "Welcome to Riften! Watch your pockets... and your back... and your front.",
      "You found Riften. The only city where pickpocketing is considered a formal greeting."
    ],
    "Markarth": [
      "Markarth: Where the beds are stone and so are the pillows.",
      "You discovered Markarth. Try not to get framed for murder this time."
    ],
    "Falkreath": [
      "Falkreath: Because every game needs a depressing forest town.",
      "You found Falkreath. More graves than citizens since... forever."
    ],
    "Morthal": [
      "Discovered Morthal. Yes, it exists!",
      "Welcome to Morthal: Skyrim's forgotten swamp town."
    ],
    "Winterhold": [
      "You found what's left of Winterhold. It's seen better centuries.",
      "Winterhold: Come for the College, stay because you're frozen solid."
    ],
    "Blackreach": [
      "Blackreach discovered. Hope you brought a flashlight and Falmer repellent.",
      "You found the underground realm of glowing mushrooms and bad decisions."
    ],
    "Helgen": [
      "Back to where it all began. Still crispy.",
      "Helgen: Skyrim's most famous before-and-after picture."
    ],
    "Jorrvaskr": [
      "You found Jorrvaskr! Please return all stolen sweetrolls.",
      "Home of the Companions: where every problem is solved with an axe."
    ],
    "Sovngarde": [
      "Welcome to Sovngarde! Try the mead. It's literally to die for.",
      "You discovered Sovngarde. Achievement unlocked: Visited heaven without dying!"
    ],
    "Dark Brotherhood Sanctuary": [
      "You found the Dark Brotherhood. We know.",
      "Sanctuary discovered. Remember: silence, my brother."
    ],
    "Azura's Shrine": [
      "You discovered Azura's Shrine. No pressure, but a goddess is watching you now.",
      "Giant statue found! Compensating for something, Azura?"
    ]
  }
}
