{
  "OnMatchingLocationDiscovered": {
    "(.*) Grotto$": [
      "Hope you brought your water boots – $1 Grotto doesn’t clean itself.",
      "Grotto life chose you. Welcome to $1.",
      "$1 Grotto discovered. Smells like wet troll and regret.",
      "$1 Grotto: Nature's basement.",
      "You found $1 Grotto. Now featuring 400% humidity and suspicious slime.",
      "$1 Grotto: Where rocks drip and hope slips.",
      "Discovered $1 Grotto. Bring a torch, and maybe some therapy.",
      "Ah, $1 Grotto. Proof Mother Nature has a dark side.",
      "Welcome to $1 Grotto. It's damp, it's dark, it's definitely cursed.",
      "$1 Grotto: Where adventurers go to get soggy and scream a lot."
    ],
    "(.*) Cave$": [
      "You discovered $1 Cave. It's probably filled with totally friendly people!",
      "$1 Cave? Classic place to catch a cold and maybe a bandit axe to the face.",
      "Echoes of your bad decisions await in $1 Cave.",
      "$1 Cave: Where the walls have eyes. And the eyes are hungry.",
      "Discovered $1 Cave. You brought fire, right? RIGHT?",
      "$1 Cave: Home of bats, bones, and 'bad idea' energy.",
      "Welcome to $1 Cave. We hope you enjoy our wide selection of echoing screams.",
      "$1 Cave: No light, no mercy, just questionable loot.",
      "$1 Cave smells like moldy bread and regret.",
      "$1 Cave – nothing like spelunking with skeletons."
    ],
    "(.*) Barrow$": [
      "Welcome to $1 Barrow. Please keep hands and feet away from the Draugr.",
      "$1 Barrow unlocked! Time to disturb ancient resting places. Again.",
      "You found $1 Barrow. Did you bring your anti-undead spray?",
      "$1 Barrow: Because disturbing the dead is your favorite hobby.",
      "Discovered $1 Barrow. Sounds like moaning... should we check?",
      "$1 Barrow smells like dust, death, and bad life choices.",
      "Barrows before bros. Welcome to $1.",
      "$1 Barrow: Where the past gets up to punch you.",
      "You entered $1 Barrow. You’ll leave covered in ash and existential dread.",
      "Welcome to $1 Barrow – population: mummies, mostly."
    ],
    "(.*) Crypt$": [
      "Congrats, $1 Crypt. 10/10 skeletons recommend it.",
      "A fine place to take your final nap: $1 Crypt.",
      "$1 Crypt – because nothing says adventure like being neck-deep in corpses.",
      "$1 Crypt: For when you want death with a side of dust.",
      "Welcome to $1 Crypt. Hope you enjoy bone piles and bad vibes.",
      "$1 Crypt discovered. The dead were *just* getting comfy.",
      "You found $1 Crypt. The skeletons found *you* first.",
      "$1 Crypt: May contain mild hauntings and moderate screaming.",
      "Discovered $1 Crypt. It’s basically a bone storage facility.",
      "$1 Crypt – come for the ancient treasures, stay because you’re now cursed."
    ],
    "(.*) Farm$": [
      "You discovered $1 Farm. Smells like honest labor and slightly less honest manure.",
      "$1 Farm: Skyrim’s #1 location for cabbage-based adventures.",
      "No dragons, just turnips. Welcome to $1 Farm.",
      "You found $1 Farm. Try not to step in anything squishy.",
      "Welcome to $1 Farm – produce, poultry, and peasant problems.",
      "$1 Farm: A great place to pretend you’re not being hunted.",
      "$1 Farm discovered. Smells like burnt wheat and poor decisions.",
      "$1 Farm: Where your dreams of peace come to die in mud.",
      "Discovered $1 Farm. The cows seem judgmental.",
      "$1 Farm – come for the grain, stay for the existential agrarian crisis."
    ],
    "(.*) Camp$": [
      "Another camp! $1 Camp might even have... tents!",
      "You found $1 Camp. Don’t step on any bear traps.",
      "$1 Camp: Because Skyrim didn’t have enough rocks and bad weather already.",
      "$1 Camp discovered. Someone forgot to put out the fire. Again.",
      "Welcome to $1 Camp – home to 5 bandits and one tragic backstory.",
      "$1 Camp: Smells like beans and broken dreams.",
      "Discovered $1 Camp. They were *just* about to stab each other.",
      "You entered $1 Camp. Prepare for yelling and arrows.",
      "$1 Camp: Now with 20% more suspicious stew.",
      "$1 Camp: No welcome mat, just blood stains."
    ],
    "(.*) Mine$": [
      "Welcome to $1 Mine. Hope you like swinging pickaxes and existential dread.",
      "You discovered $1 Mine. Ore today, gone tomorrow.",
      "$1 Mine: Not OSHA-approved, but full of character (and probably spiders).",
      "$1 Mine: Rocks, riches, and regret inside.",
      "Discovered $1 Mine. Hope you like cave-ins and coughing.",
      "$1 Mine: Where wealth meets wildly unsafe conditions.",
      "$1 Mine – the deeper you go, the worse your life choices get.",
      "You found $1 Mine. Smells like metal and despair.",
      "$1 Mine: Former workplace, current deathtrap.",
      "Welcome to $1 Mine. Try not to breathe too deep."
    ],
    "(.*) Tower$": [
      "You discovered $1 Tower. Time to climb something unnecessarily tall!",
      "What's in $1 Tower? Definitely not a romantic view and a picnic.",
      "$1 Tower: Because being grounded is for Nords with no ambition.",
      "$1 Tower discovered. 3 flights of stairs and 6 enemies later, you’re still confused.",
      "Welcome to $1 Tower. Why build horizontal when you can suffer vertically?",
      "$1 Tower – scenic view, tragic fall.",
      "Discovered $1 Tower. Gravity’s favorite playground.",
      "$1 Tower: You’ll find loot... or fall off. Possibly both.",
      "$1 Tower: Tall, ominous, and definitely occupied.",
      "You found $1 Tower. Just in time for a scenic boss fight."
    ],
    "(.*) Watchtower$": [
      "Another scenic $1 Watchtower. Trolls and arrows, guaranteed.",
      "$1 Watchtower: Perfect for spotting dragons, or getting spotted by them.",
      "You found $1 Watchtower. No one’s watching, though. They’re all dead.",
      "$1 Watchtower: The higher you climb, the worse the view gets.",
      "Discovered $1 Watchtower. Smells like smoke and regrets.",
      "$1 Watchtower: Great for panoramas, terrible for survival.",
      "Welcome to $1 Watchtower. Enjoy the corpse decor.",
      "$1 Watchtower: Built to watch, mostly watched *burn*.",
      "You entered $1 Watchtower. The last guard fell... dramatically.",
      "$1 Watchtower: Tall, empty, and probably cursed."
    ],
    "(.*) Ruins$": [
      "You discovered $1 Ruins. Bet it's full of perfectly safe architecture.",
      "$1 Ruins: Because nothing says 'tourist trap' like ancient traps.",
      "Another ruin, another day of looting cultural heritage. Thanks $1!",
      "$1 Ruins: A fixer-upper with murder potential.",
      "Discovered $1 Ruins. Smells like history and blood.",
      "$1 Ruins: Expect puzzles, poison, and pointy objects.",
      "You found $1 Ruins. Time to desecrate some ancient sadness.",
      "$1 Ruins: Old stone, old ghosts, new regrets.",
      "$1 Ruins – now featuring deluxe trap packages!",
      "$1 Ruins: A crumbling reminder that even stone has bad days."
    ],
    "(.*) Shack$": [
      "You found $1 Shack. It's cozy, if your idea of cozy is mold and splinters.",
      "$1 Shack: Home is where the bloodstains are.",
      "Discovered $1 Shack. Now with 50% more tragic backstory!",
      "$1 Shack: Not much, but it’s probably haunted.",
      "You entered $1 Shack. Something’s still living here. Maybe.",
      "$1 Shack: The furniture screams. Literally.",
      "$1 Shack: Built with 5 boards and a dream.",
      "Welcome to $1 Shack. Smells like wet fur and loneliness.",
      "$1 Shack: Abandon hope, ye who enter this plywood coffin.",
      "$1 Shack: A luxury residence for murder hobos."
    ],
    "(.*) Redoubt$": [
      "$1 Redoubt discovered. Forsworn probably not thrilled you're here.",
      "$1 Redoubt: Come for the scenery, stay for the ambushes.",
      "Discovered $1 Redoubt. Rated 3/5 stars on BanditAdvisor."
    ],
    "(.*) Stone$": [
      "$1 Stone! Time to pick a zodiac sign and pretend it matters.",
      "You found $1 Stone. Sparkly! Mysterious! Questionably useful!",
      "$1 Stone discovered. Empower yourself... or get mildly buffed."
    ],
    "(.*) Mill$": [
      "$1 Mill discovered. Smells like flour, woodchips, and childhood trauma.",
      "$1 Mill - just add water and existential dread.",
      "You discovered $1 Mill. I bet it'... rotating slowly."
    ],
    "(.*) Overlook$": [
      "$1 Overlook - because Skyrim has a law requiring scenic danger zones.",
      "Discovered $1 Overlook. Don' trip, it' a long way down.",
      "You found $1 Overlook. Majestic views. Hostile locals."
    ],
    "(.*) Hollow$": [
      "$1 Hollow: If creepy silence and suspicious fog are your thing, you're home.",
      "You discovered $1 Hollow. It's hollow inside. Like your hopes.",
      "$1 Hollow - guaranteed 60% chance of curses, 40% of awkward echoes.",
      "Welcome to $1 Hollow. Don't worry, the eyes watching you are probably just deer.",
      "Discovered $1 Hollow. Nothing screams adventure like a sunless pit.",
      "$1 Hollow: You came. You saw. You deeply regretted.",
      "Well, well, well. It’s $1 Hollow. Spooky ambiance sold separately.",
      "$1 Hollow discovered. Perfect spot for dark rituals or quiet sobbing.",
      "You entered $1 Hollow. It's... hollow. Not metaphorically.",
      "Ah, $1 Hollow. Because you clearly weren’t traumatized enough yet."
    ],
    "(.*) Summit$": [
      "You discovered $1 Summit. Oxygen sold separately.",
      "Welcome to $1 Summit. The view? Amazing. The frostbite? Also amazing.",
      "$1 Summit: Proof you make bad decisions with altitude.",
      "Discovered $1 Summit. It’s all downhill from here. Literally.",
      "$1 Summit reached. Time to scream into the void!",
      "You found $1 Summit. Your reward? Windburn and existential reflection.",
      "$1 Summit: For when you hate your knees and love snow blindness.",
      "Congratulations! $1 Summit. Now go fall dramatically.",
      "$1 Summit discovered. Do NOT shout while near the edge.",
      "Climbed to $1 Summit. There's nothing up here but bad choices."
    ],
    "(.*) Pass$": [
      "$1 Pass: Because Skyrim needed *more* ways to freeze your toes off.",
      "You found $1 Pass. The bandits are just here for the views.",
      "Welcome to $1 Pass. It passes the vibe check. Barely.",
      "Discovered $1 Pass. It's cold, narrow, and probably cursed.",
      "$1 Pass. Because straight paths are too mainstream.",
      "$1 Pass: Ideal ambush location. Just saying.",
      "You’ve entered $1 Pass. May your load order be stable.",
      "$1 Pass discovered. Foggy, creepy, and oddly romantic.",
      "$1 Pass: Because the scenic route was too cheerful.",
      "You braved $1 Pass. Hope the wolves are full already."
    ],
    "(.*) Ascent$": [
      "$1 Ascent: Stairs? In my Skyrim? It’s more likely than you think.",
      "Discovered $1 Ascent. Your calves won't thank you.",
      "$1 Ascent - because cardio is the real final boss.",
      "Welcome to $1 Ascent. Don’t look down. Or up. Just... don’t.",
      "You entered $1 Ascent. Try not to lose your footing *or* your soul.",
      "$1 Ascent: One does not simply walk up here. Except you. You did.",
      "$1 Ascent discovered. Keep climbing. Regret comes later.",
      "$1 Ascent. You’re ascending! Spiritually? No. Physically? Barely.",
      "You reached $1 Ascent. Now your thighs know pain.",
      "$1 Ascent: When fast travel just isn’t punishing enough."
    ],
    "(.*) Crossing$": [
      "Discovered $1 Crossing. It's a crossroads for bad life choices.",
      "$1 Crossing: Now with 200% more skeevers than you'd prefer.",
      "Welcome to $1 Crossing. Don’t forget to look both ways—for bears.",
      "$1 Crossing discovered. A scenic stop on your way to oblivion.",
      "You found $1 Crossing. Which means something's about to find *you*.",
      "$1 Crossing: Smells like danger and wet moss.",
      "$1 Crossing. Who knew intersections could feel this cursed?",
      "You entered $1 Crossing. Too quiet. Way too quiet.",
      "Welcome to $1 Crossing. Bring a snack and a sword.",
      "$1 Crossing: Good luck crossing without incident. LOL."
    ],
    "(.*) Outlook$": [
      "$1 Outlook: Your future looks... grim. Very grim.",
      "You discovered $1 Outlook. Forecast: 90% chance of arrows.",
      "$1 Outlook: Great views, terrible survivability.",
      "Welcome to $1 Outlook. Where the only thing watching is the predator.",
      "You reached $1 Outlook. Don't get attached to your kneecaps.",
      "$1 Outlook discovered. You came for peace; you found wolves.",
      "Behold: $1 Outlook. Gaze upon your fate.",
      "$1 Outlook: The outlook is bleak. But scenic!",
      "You found $1 Outlook. You won't like what you see.",
      "$1 Outlook: One last look before you get ambushed."
    ],
    "(.*) Chasm$": [
      "$1 Chasm: Look into the abyss, and hope it doesn’t wink back.",
      "Discovered $1 Chasm. Echoes included at no extra cost.",
      "You found $1 Chasm. Bet there's something nasty at the bottom.",
      "$1 Chasm: Because Skyrim needed *deeper* metaphorical pits.",
      "$1 Chasm discovered. Try not to fall into plot relevance.",
      "You reached $1 Chasm. Time to jump? No? Okay.",
      "$1 Chasm: All the gravity, none of the guardrails.",
      "$1 Chasm is here! Perfect for yelling into while questioning your build.",
      "Welcome to $1 Chasm. You're not alone down there.",
      "$1 Chasm: They say even the light fears to descend."
    ]
  }
}
