{
  "OnSpecificLocationDiscovered": {
    "Pelagia Farm": [
      "Ah yes, the thrill of... cabbage?",
      "You discovered Pelagia Farm. Slow down, adventurer.",
      "Greetings from Pelagia Farm. Mind the sabre cats.",
      "Pelagia Farm: Still here after all these in-game years.",
      "Ah yes, Pelagia Farm. Smells like adventure and NPC pathfinding errors."
    ],
    "Solitude Lighthouse": [
      "You found the lighthouse. Try not to fall off.",
      "Solitude Lighthouse: because someone has to keep ships from crashing.",
      "Greetings from Solitude Lighthouse. Mind the sabre cats.",
      "You found Solitude Lighthouse! Hope you brought snacks.",
      "New location: Solitude Lighthouse. Still safer than Solstheim."
    ],
    "Thalmor Embassy": [
      "Thalmor spotted. Better keep your mouth shut.",
      "You're not supposed to be here... are you?",
      "Greetings from Thalmor Embassy. Mind the sabre cats.",
      "Another day, another discovery: Thalmor Embassy.",
      "Ah yes, Thalmor Embassy. Smells like adventure and NPC pathfinding errors."
    ],
    "Clearpine Pond": [
      "It's a pond. It's clear. It's piney. Nature, wow.",
      "Discovered a pond. Good job, Dovah-fish.",
      "Clearpine Pond? Again? Maybe it's fate.",
      "You found Clearpine Pond! Hope you brought snacks.",
      "New location: Clearpine Pond. Still safer than Solstheim."
    ],
    "Ragnvald": [
      "Home of restless draugr and bad decisions.",
      "You found Ragnvald! Now turn around and pretend you didn't.",
      "Hey look, it's Ragnvald! Cue dramatic music.",
      "Another day, another discovery: Ragnvald.",
      "Ragnvald: Still here after all these in-game years."
    ],
    "The Guardian Stones": [
      "Choose your fate! Or just fast-travel away.",
      "Ah, Skyrim's starting zone... nostalgic, huh?",
      "Step into The Guardian Stones — population: suspiciously quiet.",
      "Another day, another discovery: The Guardian Stones.",
      "Hey look, it's The Guardian Stones! Cue dramatic music."
    ],
    "Shor's Stone": [
      "A tiny town with big mining dreams.",
      "You found Shor’s Stone. Population: barely.",
      "Look at you, discovering Shor's Stone like a pro.",
      "Hey look, it's Shor's Stone! Cue dramatic music.",
      "You found Shor's Stone! Hope you brought snacks."
    ],
    "Glenmoril Coven": [
      "Witch central! Smells like alchemy and regret.",
      "Discovered Glenmoril Coven. Time to hex someone.",
      "Greetings from Glenmoril Coven. Mind the sabre cats.",
      "Glenmoril Coven? Again? Maybe it's fate.",
      "Another day, another discovery: Glenmoril Coven."
    ],
    "Honningbrew Meadery": [
      "Mead, mead, glorious mead!",
      "Found the meadery. Hope you brought a drinking horn.",
      "Honningbrew Meadery? Again? Maybe it's fate.",
      "You found Honningbrew Meadery! Hope you brought snacks.",
      "Another day, another discovery: Honningbrew Meadery."
    ],
    "Snapleg Cave": [
      "What a charming name. What could go wrong?",
      "Discovered Snapleg Cave. Try to keep yours intact.",
      "Hey look, it's Snapleg Cave! Cue dramatic music.",
      "Step into Snapleg Cave — population: suspiciously quiet.",
      "You found Snapleg Cave! Hope you brought snacks."
    ],
    "Bilegulch Mine": [
      "You found Bilegulch Mine. Sounds... appetizing?",
      "Ore and orcs and ouch.",
      "Look at you, discovering Bilegulch Mine like a pro.",
      "You found Bilegulch Mine! Hope you brought snacks.",
      "Bilegulch Mine? Again? Maybe it's fate."
    ],
    "Embershard Mine": [
      "Classic starter dungeon. Feeling nostalgic?",
      "Ah, Embershard — the first cave every player clears accidentally.",
      "Look at you, discovering Embershard Mine like a pro.",
      "Step into Embershard Mine — population: suspiciously quiet.",
      "Hey look, it's Embershard Mine! Cue dramatic music."
    ],
    "College of Winterhold": [
      "School of magic or frostbite simulator?",
      "You discovered the College! Please don't blow it up.",
      "College of Winterhold? Again? Maybe it's fate.",
      "You found College of Winterhold! Hope you brought snacks.",
      "Step into College of Winterhold — population: suspiciously quiet."
    ],
    "Forelhost": [
      "Forelhost. For real ghosts.",
      "One word: Draugr.",
      "Greetings from Forelhost. Mind the sabre cats.",
      "New location: Forelhost. Still safer than Solstheim.",
      "You found Forelhost! Hope you brought snacks."
    ],
    "Castle Volkihar": [
      "You've reached vampire HQ. Bring garlic.",
      "Castle Volkihar — now featuring 80% more brooding.",
      "Castle Volkihar? Again? Maybe it's fate.",
      "Greetings from Castle Volkihar. Mind the sabre cats.",
      "Step into Castle Volkihar — population: suspiciously quiet."
    ],
    "Dawnstar": [
      "Sleepy coastal town. Emphasis on nightmares.",
      "Welcome to Dawnstar. Population: insomniacs.",
      "Step into Dawnstar — population: suspiciously quiet.",
      "Look at you, discovering Dawnstar like a pro.",
      "Greetings from Dawnstar. Mind the sabre cats.",
      "You found Dawnstar! Hope you brought snacks.",
      "New location: Dawnstar. Still safer than Solstheim.",
      "Dawnstar: Still here after all these in-game years.",
      "Ah yes, Dawnstar. Smells like adventure and NPC pathfinding errors.",
      "Another day, another discovery: Dawnstar."
    ],
    "The Throat of the World": [
      "Top of the world, Ma!",
      "Hope you brought a coat.",
      "Step into The Throat of the World — population: suspiciously quiet.",
      "Greetings from The Throat of the World. Mind the sabre cats.",
      "Ah yes, The Throat of the World. Smells like adventure and NPC pathfinding errors."
    ],
    "High Hrothgar": [
      "So many steps... so much wheezing.",
      "You met the Greybeards! No shouting indoors.",
      "Greetings from High Hrothgar. Mind the sabre cats.",
      "New location: High Hrothgar. Still safer than Solstheim.",
      "High Hrothgar: Still here after all these in-game years."
    ],
    "Riverwood": [
      "Where every journey begins — and chickens fear you.",
      "Riverwood: scenic, peaceful, terribly doomed if you sneeze.",
      "Hey look, it's Riverwood! Cue dramatic music.",
      "New location: Riverwood. Still safer than Solstheim.",
      "Riverwood? Again? Maybe it's fate.",
      "Another day, another discovery: Riverwood.",
      "Step into Riverwood — population: suspiciously quiet.",
      "Riverwood: Still here after all these in-game years.",
      "Ah yes, Riverwood. Smells like adventure and NPC pathfinding errors.",
      "Look at you, discovering Riverwood like a pro."
    ],
    "Bleak Falls Barrow": [
      "You discovered the tutorial dungeon! Again.",
      "Guaranteed to have a claw puzzle and restless Draugr.",
      "You found Bleak Falls Barrow! Hope you brought snacks.",
      "New location: Bleak Falls Barrow. Still safer than Solstheim.",
      "Bleak Falls Barrow? Again? Maybe it's fate.",
      "Bleak Falls Barrow: Still here after all these in-game years.",
      "Look at you, discovering Bleak Falls Barrow like a pro.",
      "Another day, another discovery: Bleak Falls Barrow.",
      "Hey look, it's Bleak Falls Barrow! Cue dramatic music.",
      "Step into Bleak Falls Barrow — population: suspiciously quiet."
    ],
    "Labyrinthian": [
      "It's big. It's cold. It's full of regrets.",
      "You found Labyrinthian. Good luck finding the exit.",
      "Step into Labyrinthian — population: suspiciously quiet.",
      "New location: Labyrinthian. Still safer than Solstheim.",
      "Labyrinthian? Again? Maybe it's fate."
    ],
    "Fort Dawnguard": [
      "Home of the vampire hunters! And some questionable interior decorating.",
      "You discovered Fort Dawnguard. Now slay responsibly.",
      "Fort Dawnguard? Again? Maybe it's fate.",
      "Hey look, it's Fort Dawnguard! Cue dramatic music.",
      "Ah yes, Fort Dawnguard. Smells like adventure and NPC pathfinding errors."
    ],
    "Windhelm": [
      "Welcome to Windhelm! Where it's always winter and never Christmas.",
      "You discovered Windhelm. The only place where hypothermia is considered a tourist attraction.",
      "Look at you, discovering Windhelm like a pro.",
      "Windhelm: Still here after all these in-game years.",
      "You found Windhelm! Hope you brought snacks.",
      "Another day, another discovery: Windhelm.",
      "Hey look, it's Windhelm! Cue dramatic music.",
      "Ah yes, Windhelm. Smells like adventure and NPC pathfinding errors.",
      "Greetings from Windhelm. Mind the sabre cats.",
      "Windhelm? Again? Maybe it's fate."
    ],
    "Whiterun": [
      "Ah, Whiterun. Home of overpriced houses and an unnecessary amount of stairs.",
      "You discovered Whiterun. Please don't climb the Dragonsreach walls again.",
      "You found Whiterun! Hope you brought snacks.",
      "Step into Whiterun — population: suspiciously quiet.",
      "Ah yes, Whiterun. Smells like adventure and NPC pathfinding errors.",
      "Greetings from Whiterun. Mind the sabre cats.",
      "Another day, another discovery: Whiterun.",
      "Hey look, it's Whiterun! Cue dramatic music.",
      "Whiterun? Again? Maybe it's fate.",
      "Whiterun: Still here after all these in-game years."
    ],
    "Riften": [
      "Welcome to Riften! Watch your pockets... and your back... and your front.",
      "You found Riften. The only city where pickpocketing is considered a formal greeting.",
      "Another day, another discovery: Riften.",
      "You found Riften! Hope you brought snacks.",
      "New location: Riften. Still safer than Solstheim.",
      "Greetings from Riften. Mind the sabre cats.",
      "Riften? Again? Maybe it's fate.",
      "Hey look, it's Riften! Cue dramatic music.",
      "Ah yes, Riften. Smells like adventure and NPC pathfinding errors.",
      "Step into Riften — population: suspiciously quiet."
    ],
    "Markarth": [
      "Markarth: Where the beds are stone and so are the pillows.",
      "You discovered Markarth. Try not to get framed for murder this time.",
      "Markarth? Again? Maybe it's fate.",
      "New location: Markarth. Still safer than Solstheim.",
      "Step into Markarth — population: suspiciously quiet.",
      "You found Markarth! Hope you brought snacks.",
      "Another day, another discovery: Markarth.",
      "Greetings from Markarth. Mind the sabre cats.",
      "Hey look, it's Markarth! Cue dramatic music.",
      "Markarth: Still here after all these in-game years."
    ],
    "Falkreath": [
      "Falkreath: Because every game needs a depressing forest town.",
      "You found Falkreath. More graves than citizens since... forever.",
      "Falkreath? Again? Maybe it's fate.",
      "You found Falkreath! Hope you brought snacks.",
      "Greetings from Falkreath. Mind the sabre cats.",
      "Another day, another discovery: Falkreath.",
      "Ah yes, Falkreath. Smells like adventure and NPC pathfinding errors.",
      "Falkreath: Still here after all these in-game years.",
      "New location: Falkreath. Still safer than Solstheim.",
      "Step into Falkreath — population: suspiciously quiet."
    ],
    "Morthal": [
      "Discovered Morthal. Yes, it exists!",
      "Welcome to Morthal: Skyrim's forgotten swamp town.",
      "Greetings from Morthal. Mind the sabre cats.",
      "Ah yes, Morthal. Smells like adventure and NPC pathfinding errors.",
      "You found Morthal! Hope you brought snacks.",
      "Look at you, discovering Morthal like a pro.",
      "New location: Morthal. Still safer than Solstheim.",
      "Morthal: Still here after all these in-game years.",
      "Another day, another discovery: Morthal.",
      "Hey look, it's Morthal! Cue dramatic music."
    ],
    "Winterhold": [
      "You found what's left of Winterhold. It's seen better centuries.",
      "Winterhold: Come for the College, stay because you're frozen solid.",
      "Ah yes, Winterhold. Smells like adventure and NPC pathfinding errors.",
      "Look at you, discovering Winterhold like a pro.",
      "You found Winterhold! Hope you brought snacks.",
      "Winterhold? Again? Maybe it's fate.",
      "Hey look, it's Winterhold! Cue dramatic music.",
      "Greetings from Winterhold. Mind the sabre cats.",
      "Step into Winterhold — population: suspiciously quiet.",
      "New location: Winterhold. Still safer than Solstheim."
    ],
    "Blackreach": [
      "Blackreach discovered. Hope you brought a flashlight and Falmer repellent.",
      "You found the underground realm of glowing mushrooms and bad decisions.",
      "New location: Blackreach. Still safer than Solstheim.",
      "Look at you, discovering Blackreach like a pro.",
      "Step into Blackreach — population: suspiciously quiet."
    ],
    "Helgen": [
      "Back to where it all began. Still crispy.",
      "Helgen: Skyrim's most famous before-and-after picture.",
      "You found Helgen! Hope you brought snacks.",
      "Ah yes, Helgen. Smells like adventure and NPC pathfinding errors.",
      "Helgen? Again? Maybe it's fate.",
      "Greetings from Helgen. Mind the sabre cats.",
      "Another day, another discovery: Helgen.",
      "Helgen: Still here after all these in-game years.",
      "Look at you, discovering Helgen like a pro.",
      "New location: Helgen. Still safer than Solstheim."
    ],
    "Jorrvaskr": [
      "You found Jorrvaskr! Please return all stolen sweetrolls.",
      "Home of the Companions: where every problem is solved with an axe.",
      "You found Jorrvaskr! Hope you brought snacks.",
      "Another day, another discovery: Jorrvaskr.",
      "Ah yes, Jorrvaskr. Smells like adventure and NPC pathfinding errors."
    ],
    "Sovngarde": [
      "Welcome to Sovngarde! Try the mead. It's literally to die for.",
      "You discovered Sovngarde. Achievement unlocked: Visited heaven without dying!",
      "Ah yes, Sovngarde. Smells like adventure and NPC pathfinding errors.",
      "Look at you, discovering Sovngarde like a pro.",
      "Sovngarde: Still here after all these in-game years."
    ],
    "Dark Brotherhood Sanctuary": [
      "You found the Dark Brotherhood. We know.",
      "Sanctuary discovered. Remember: silence, my brother.",
      "Dark Brotherhood Sanctuary? Again? Maybe it's fate.",
      "Step into Dark Brotherhood Sanctuary — population: suspiciously quiet.",
      "You found Dark Brotherhood Sanctuary! Hope you brought snacks."
    ],
    "Azura's Shrine": [
      "You discovered Azura's Shrine. No pressure, but a goddess is watching you now.",
      "Giant statue found! Compensating for something, Azura?",
      "Hey look, it's Azura's Shrine! Cue dramatic music.",
      "Greetings from Azura's Shrine. Mind the sabre cats.",
      "Ah yes, Azura's Shrine. Smells like adventure and NPC pathfinding errors."
    ]
  }
}
