{
  "PercentageDiscoveredMessages": {
    "0": [
      "You haven't even stepped outside, have you?",
      "0% complete. Maybe try leaving the tutorial cave first?",
      "Adventure awaits. Literally anywhere but here.",
      "The dragons are out there. Probably. Go look!",
      "The world is your oyster! Now crack it open.",
      "Staring at your journal won't make locations appear.",
      "Pro tip: There's stuff outside this menu.",
      "Even the chickens have explored more than you.",
      "It's dangerous to go alone... so maybe start moving?",
      "Your boots look awfully clean for an adventurer."
    ],
    "1": [
      "1% complete. Bold of you to open your journal this early.",
      "You found something! A single something. Woo!",
      "A journey begins with a single step. Like that one.",
      "Look at you, already making progress. Slow, tiny progress.",
      "The bards will sing of this single location.",
      "Congrats on moving slightly beyond zero!",
      "Achievement unlocked: Minimum Effort.",
      "You did a thing! Now go do more things.",
      "Wow, you've officially begun exploring. Barely.",
      "That's a start, now keep going."
    ],
    "2": [
      "2% complete. Twice as good as 1%, technically.",
      "Another location down, countless more to go!",
      "Hey, you're gaining momentum! Slightly.",
      "2% isn't zero, keep at it!",
      "Twice the exploring, twice the fun, right?",
      "At this rate, you'll be done by next century!",
      "You've doubled your efforts, keep it going!",
      "Adventure awaits, inch by inch!",
      "Progress detected: minimal but real.",
      "Slow and steady finds the locations."
    ],
    "3": [
      "3% complete. You're officially moving!",
      "The exploring is real now. Slightly realer.",
      "You're now a novice explorer, congrats!",
      "That third location really ties it together.",
      "Triple the locations, triple the adventure!",
      "Three places down, the whole map to go!",
      "You're officially an adventurer, sort of.",
      "3%? More like thrice percent!",
      "Look at you go, slowly but surely!",
      "Small steps lead to big adventures."
    ],
    "4": [
      "4% complete. Hey, that's almost noticeable!",
      "You're getting places—literally!",
      "Four down, many more exciting spots ahead.",
      "Your adventurer card has now been punched four times.",
      "That's right, four whole locations explored!",
      "Skyrim whispers about your four-location legacy.",
      "You've officially seen more than most mudcrabs.",
      "Keep going, you’re basically unstoppable now.",
      "Four down, only hundreds left!",
      "This adventure is practically rolling itself!"
    ],
    "5": [
      "5% complete! A nice, round number at last!",
      "Look who's officially an adventurer!",
      "Five percent down, ninety-five percent fun to go!",
      "You're practically a map-making prodigy.",
      "Achievement unlocked: Actually Trying.",
      "One twentieth complete—celebrate briefly!",
      "Five percent, officially better than four!",
      "Keep it up, explorer-in-training!",
      "You’re getting somewhere—literally five somewheres!",
      "Congrats, you're no longer totally lost!"
    ],
    "6": [
      "6% complete! That's more than a handful!",
      "Okay, now we're cooking with exploration.",
      "You're beginning to master walking aimlessly.",
      "The locations tremble at your approach.",
      "Look at this unstoppable exploring force.",
      "You've discovered slightly more than your backyard!",
      "One small step for Dragonborn, one giant leap for mapkind.",
      "Your journal is getting heavier with glory.",
      "At 6%, you're officially dedicated.",
      "Slowly becoming a true explorer!"
    ],
    "7": [
      "7% complete! Lucky number seven locations.",
      "You're practically a tour guide now!",
      "This exploring thing seems to suit you.",
      "Just 93% left to conquer!",
      "Seven locations down, many more to enjoy!",
      "Your boots have seen things. Seven things.",
      "You’re officially getting the hang of this.",
      "Seven places visited, the world awaits!",
      "The adventure really begins at seven percent!",
      "Keep exploring, Skyrim’s just warming up."
    ],
    "8": [
      "8% complete. Not quite a hero yet, but look at you go!",
      "8% complete. A small step for you, a giant leap for your map.",
      "8% done. Baby steps are still steps.",
      "At 8%, maybe try venturing beyond the familiar.",
      "8% complete. Every location counts, even if it’s a modest start.",
      "8% progress. Time to trade those safe spots for adventure.",
      "You've hit 8%. The world is calling—sort of.",
      "8% discovered. Keep those feet moving!",
      "At 8%, the journey's just begun. Keep at it!",
      "8% complete. Even the mudcrabs pace themselves."
    ],
    "9": [
      "9% complete. Not bad—you're off the couch!",
      "At 9%, you're inching toward something great.",
      "9% done. A tiny victory in a vast world.",
      "9% complete. The road ahead is still long, champ.",
      "9% progress. Even a spark can ignite a legend.",
      "You've reached 9%. Keep that momentum alive!",
      "9% discovered. Every step is a step forward.",
      "At 9%, your adventure is slowly taking shape.",
      "9% complete. More than a beginning—almost a commitment!",
      "9% progress. The journey is as quirky as you are."
    ],
    "10": [
      "10% complete. Not too shabby for a wandering soul.",
      "You've reached 10%! The journey is officially underway.",
      "10% done. Every location now counts twice.",
      "At 10%, you're turning heads—and maps.",
      "10% progress. The realm starts to notice you.",
      "10% complete. A solid step toward legendary status.",
      "10% discovered. Your adventure is gaining momentum.",
      "At 10%, you're proving that even small strides matter.",
      "10% done. The legend of your exploration begins.",
      "10% complete. Keep that adventurous spirit alive!"
    ],
    "11": [
      "11% complete. A little more than a rookie's wander.",
      "At 11%, your map is starting to feel familiar.",
      "11% done. Every percentage point is a win.",
      "11% progress. You’re making strides in a big world.",
      "11% complete. A modest start to an epic tale.",
      "11% discovered. The bards might start a tune about you soon.",
      "11% progress. Even slow progress is progress.",
      "At 11%, your adventure has just picked up pace.",
      "11% done. Every step forward is a victory.",
      "11% complete. The journey just got a bit more interesting."
    ],
    "12": [
      "12% complete. Not too shabby—keep stepping forward!",
      "At 12%, you're proving that exploration is an art.",
      "12% done. A dozen percent and counting!",
      "12% progress. Every new spot is a new story.",
      "12% complete. Your journey is picking up some pace.",
      "12% discovered. The realm is slowly unveiling its secrets.",
      "12% progress. One step at a time to greatness.",
      "At 12%, you’re making a mark on the map.",
      "12% done. The adventure grows with every location.",
      "12% complete. Keep pushing; the world awaits!"
    ],
    "13": [
      "13% complete. A baker’s dozen percent of pure exploration!",
      "At 13%, you're defying the odds, one location at a time.",
      "13% done. Each percentage is a badge of honor.",
      "13% progress. The world is unfolding before you.",
      "13% complete. Keep adding to that growing legend.",
      "13% discovered. Every new spot counts in your tale.",
      "13% progress. You're slowly piecing together Skyrim's puzzle.",
      "At 13%, your map is beginning to tell a story.",
      "13% done. Even small numbers add up to greatness.",
      "13% complete. One step closer to becoming a legend."
    ],
    "14": [
      "14% complete. Almost a fifth of the journey is done!",
      "At 14%, you’re making noticeable progress.",
      "14% done. Your adventures are starting to add up.",
      "14% progress. The map appreciates every bit of effort.",
      "14% complete. Every location makes the story richer.",
      "14% discovered. Your journey is getting more interesting.",
      "14% progress. Even a modest pace can lead to epic tales.",
      "At 14%, your exploration is steadily ramping up.",
      "14% done. Keep at it; the realm awaits!",
      "14% complete. The adventure continues, one step at a time."
    ],
    "15": [
      "15% complete. A neat round number—almost a sixth of the map!",
      "At 15%, you’re proving that progress comes in small steps.",
      "15% done. Every bit counts on the road to glory.",
      "15% progress. You’re steadily turning the map into your playground.",
      "15% complete. A promising start for a brave explorer.",
      "15% discovered. The world’s mysteries are slowly unfurling.",
      "15% progress. One step closer to epic adventures.",
      "At 15%, your journey is gaining a heroic rhythm.",
      "15% done. Keep those boots moving!",
      "15% complete. Even modest progress is a win."
    ],
    "16": [
      "16% complete. Sweet sixteen percent of pure exploration!",
      "At 16%, you're on a roll—even if it's a baby roll.",
      "16% done. The journey's pace is uniquely yours.",
      "16% progress. Every new location adds to your legend.",
      "16% complete. The world is slowly but surely being revealed.",
      "16% discovered. Keep it up; adventure loves consistency.",
      "16% progress. Your map is starting to look impressive.",
      "At 16%, you’re turning the unknown into known.",
      "16% done. Every percentage point is progress.",
      "16% complete. The journey is as quirky as you are."
    ],
    "17": [
      "17% complete. Seventeen percent and growing—nice work!",
      "At 17%, you’re proving that every step matters.",
      "17% done. A steady pace leads to epic discoveries.",
      "17% progress. The realm is slowly unveiling its secrets.",
      "17% complete. Each new spot is a victory lap.",
      "17% discovered. Your adventure is becoming a saga.",
      "17% progress. Not every hero moves at lightning speed.",
      "At 17%, the map is starting to reflect your journey.",
      "17% done. Keep exploring, one step at a time.",
      "17% complete. Even small strides create legends."
    ],
    "18": [
      "18% complete. Look at you, conquering 18% of the map!",
      "At 18%, you're steadily turning the unknown into yours.",
      "18% done. Every new discovery builds your story.",
      "18% progress. Not a small feat in a vast world.",
      "18% complete. The adventure is growing with you.",
      "18% discovered. Every location adds a chapter to your tale.",
      "18% progress. Keep at it—the world isn’t going to explore itself.",
      "At 18%, your map is slowly taking shape.",
      "18% done. One percentage at a time, hero.",
      "18% complete. Your journey is uniquely epic."
    ],
    "19": [
      "19% complete. Nineteen percent—now that's progress!",
      "At 19%, your map is starting to feel like your playground.",
      "19% done. Every location is a step closer to legend.",
      "19% progress. Keep forging ahead, one spot at a time.",
      "19% complete. The world’s secrets are gradually revealed.",
      "19% discovered. Each percentage point adds to your saga.",
      "19% progress. Even slow progress is epic progress.",
      "At 19%, you’re turning the mundane into adventure.",
      "19% done. Keep pushing; greatness awaits.",
      "19% complete. Your journey is off to a legendary start."
    ],
    "20": [
      "20% complete. A solid fifth of the adventure—nice!",
      "At 20%, you're officially in the exploration game.",
      "20% done. Every bit of progress tells a story.",
      "20% progress. The world is unfolding with each step.",
      "20% complete. Your map is getting a lot more interesting.",
      "20% discovered. Two out of ten parts of your epic saga are done!",
      "20% progress. The adventure is growing with you.",
      "At 20%, you’re showing real determination.",
      "20% done. Keep making those small wins count.",
      "20% complete. A great start to a grand journey."
    ],
    "21": [
      "21% complete. Twenty-one percent and still hungry for more!",
      "At 21%, you’re making progress that even the bards notice.",
      "21% done. Each location is a step towards greatness.",
      "21% progress. The map is slowly turning into your personal diary.",
      "21% complete. Your adventure is starting to look epic.",
      "21% discovered. Keep collecting those tiny victories.",
      "21% progress. A little more each time builds legends.",
      "At 21%, you’re proving that persistence pays off.",
      "21% done. Every step forward is a win.",
      "21% complete. Your map is beginning to tell an amazing story."
    ],
    "22": [
      "22% complete. Not quite a quarter, but nearly there!",
      "At 22%, your journey is steadily picking up speed.",
      "22% done. Every new spot is a testament to your grit.",
      "22% progress. The realm is slowly yielding its secrets.",
      "22% complete. Your map is starting to get interesting.",
      "22% discovered. Keep at it—the world isn’t waiting!",
      "22% progress. Every little discovery builds your legend.",
      "At 22%, you’re on a roll, one location at a time.",
      "22% done. Keep moving; the adventure is alive.",
      "22% complete. The journey continues, one step at a time."
    ],
    "23": [
      "23% complete. Twenty-three percent—you're gaining traction!",
      "At 23%, each location is a step towards epic tales.",
      "23% done. Your map is getting its first real makeover.",
      "23% progress. The world is revealing its quirks to you.",
      "23% complete. Keep exploring, there's more to see.",
      "23% discovered. Every bit counts in your journey.",
      "23% progress. You’re slowly but surely making history.",
      "At 23%, your adventure is picking up some serious steam.",
      "23% done. Every percentage is a story waiting to be told.",
      "23% complete. Keep at it—the realm needs you."
    ],
    "24": [
      "24% complete. Nearly a quarter of the map is yours!",
      "At 24%, your journey is turning into a saga.",
      "24% done. Every new discovery writes another line in your epic.",
      "24% progress. The world is slowly coming to life under your steps.",
      "24% complete. Your map is starting to show your personality.",
      "24% discovered. Keep adding those unique spots to your story.",
      "24% progress. You’re on a mission, one step at a time.",
      "At 24%, you’re making the unknown known.",
      "24% done. Every location is a win.",
      "24% complete. Your adventure is as quirky as it is epic."
    ],
    "25": [
      "25% complete. A quarter of the journey done—nice milestone!",
      "At 25%, you're hitting your stride in Skyrim.",
      "25% done. Every location brings you closer to greatness.",
      "25% progress. The map is starting to reflect your efforts.",
      "25% complete. Keep it up; you’re quartering your way to legend.",
      "25% discovered. Your adventure is gathering momentum.",
      "25% progress. Every step adds a page to your epic.",
      "At 25%, you’re well on your way to a legendary map.",
      "25% done. The journey is as rewarding as it is long.",
      "25% complete. A solid start for an intrepid explorer."
    ],
    "26": [
      "26% complete. Not far from a third of your adventure!",
      "At 26%, your map is getting richer by the minute.",
      "26% done. Every location is a small victory.",
      "26% progress. Your journey is steadily unfolding.",
      "26% complete. Keep exploring; every step counts.",
      "26% discovered. Your adventure is slowly building up.",
      "26% progress. Even small gains lead to epic stories.",
      "At 26%, you’re crafting your own legend.",
      "26% done. The map is starting to show your influence.",
      "26% complete. One step closer to full-blown heroics."
    ],
    "27": [
      "27% complete. Twenty-seven percent—your legend is budding!",
      "At 27%, you’re making real headway in your quest.",
      "27% done. Every discovery is a step towards epic status.",
      "27% progress. The world is slowly unveiling its wonders.",
      "27% complete. Your map tells a tale of perseverance.",
      "27% discovered. Keep pushing; the adventure awaits.",
      "27% progress. You’re steadily turning the tides in Skyrim.",
      "At 27%, every location adds to your growing legacy.",
      "27% done. Small victories lead to grand adventures.",
      "27% complete. Your journey is as vibrant as it is brave."
    ],
    "28": [
      "28% complete. Almost a third of your adventure is done!",
      "At 28%, you're steadily etching your mark on Skyrim.",
      "28% done. Every new spot is a win for exploration.",
      "28% progress. The realm is slowly opening its secrets to you.",
      "28% complete. Your map is a canvas of adventures.",
      "28% discovered. Keep at it; every percentage matters.",
      "28% progress. You’re on a path to legendary status.",
      "At 28%, your journey is becoming truly epic.",
      "28% done. One step at a time to total exploration.",
      "28% complete. The adventure grows with each new discovery."
    ],
    "29": [
      "29% complete. Almost 30% done—impressive for a wanderer!",
      "At 29%, your map is starting to look like a masterpiece.",
      "29% done. Every location is another brushstroke in your epic.",
      "29% progress. The world is slowly revealing its charm.",
      "29% complete. Your adventure is shaping up nicely.",
      "29% discovered. Keep exploring; each step counts.",
      "29% progress. Even nearly 30% is just the beginning.",
      "At 29%, your journey is gaining remarkable pace.",
      "29% done. Every spot is a victory in your quest.",
      "29% complete. The realm takes notice of your persistent steps."
    ],
    "30": [
      "30% complete. A solid start—nearly a third of the map explored!",
      "At 30%, your adventure is starting to look epic.",
      "30% done. Every location adds to your growing legend.",
      "30% progress. The map is beginning to reflect your efforts.",
      "30% complete. Keep at it; the realm is watching.",
      "30% discovered. Every step forward is a win.",
      "30% progress. Your exploration is turning heads in Skyrim.",
      "At 30%, you're well on your way to epic proportions.",
      "30% done. The journey is as rewarding as it is long.",
      "30% complete. Keep exploring; there's so much more out there!"
    ],
    "31": [
      "31% complete. Solid progress—you're on a roll!",
      "At 31%, your map is starting to tell a story.",
      "31% done. Every location builds your legend.",
      "31% progress. The journey is getting more interesting.",
      "31% complete. Your steps are echoing through Skyrim.",
      "31% discovered. Each new spot is a victory.",
      "31% progress. The realm is slowly falling under your spell.",
      "At 31%, you’re well on your way to becoming a legend.",
      "31% done. The adventure grows with every step.",
      "31% complete. Keep paving your epic path!"
    ],
    "32": [
      "32% complete. You're making steady, if not flashy, progress!",
      "At 32%, your journey is painting a vivid tale.",
      "32% done. Every percentage point is a win.",
      "32% progress. The map is starting to show your influence.",
      "32% complete. Keep at it; your legend is forming.",
      "32% discovered. The realm slowly yields its secrets.",
      "32% progress. Every step is a step toward greatness.",
      "At 32%, your adventure is gathering momentum.",
      "32% done. Your map is becoming a storybook of exploration.",
      "32% complete. The journey is uniquely yours."
    ],
    "33": [
      "33% complete. A third of the way—fancy that!",
      "At 33%, your progress is as quirky as it is real.",
      "33% done. Every location is a new badge of honor.",
      "33% progress. The realm is slowly coming into focus.",
      "33% complete. Your map is taking shape in bold strokes.",
      "33% discovered. Keep at it; the adventure beckons.",
      "33% progress. Your journey is steadily amassing tales.",
      "At 33%, every step adds to your epic saga.",
      "33% done. The world is slowly bending to your will.",
      "33% complete. Embrace the quirky journey ahead!"
    ],
    "34": [
      "34% complete. The journey’s pace is uniquely yours.",
      "At 34%, every discovered spot is a mini triumph.",
      "34% done. Your map is filling with epic moments.",
      "34% progress. Keep exploring—the realm is yours to tame.",
      "34% complete. Each percentage point is a step toward glory.",
      "34% discovered. Your adventure is as bold as you are.",
      "34% progress. The land is slowly becoming familiar.",
      "At 34%, your legend is in the making.",
      "34% done. Keep striding forward—greatness awaits.",
      "34% complete. The world is slowly unfolding for you."
    ],
    "35": [
      "35% complete. Over a third done—nice steady progress!",
      "At 35%, you're carving out your own epic tale.",
      "35% done. Every location adds to your storied journey.",
      "35% progress. The map is gradually reflecting your efforts.",
      "35% complete. Keep exploring; adventure is knocking.",
      "35% discovered. Every step builds your legend further.",
      "35% progress. Your journey is one for the bards to sing about.",
      "At 35%, you’re steadily turning the unknown into history.",
      "35% done. The realm is noticing your persistent steps.",
      "35% complete. Your map is your canvas—keep painting!"
    ],
    "36": [
      "36% complete. Your journey just got a bit more interesting!",
      "At 36%, every location is a building block of your epic.",
      "36% done. The realm is slowly unfolding its mysteries.",
      "36% progress. Keep it up; your map is taking shape.",
      "36% complete. Every new spot is a notch on your belt.",
      "36% discovered. Your adventure is growing with each step.",
      "36% progress. The world is gradually coming to you.",
      "At 36%, you’re on a quest that even dragons envy.",
      "36% done. One percentage closer to total domination.",
      "36% complete. Your journey is a work in progress—and it's brilliant!"
    ],
    "37": [
      "37% complete. Every step counts—look at you go!",
      "At 37%, your map is beginning to look epic.",
      "37% done. Another percentage point for the history books.",
      "37% progress. The realm is slowly falling under your charm.",
      "37% complete. Keep adding to your legendary map.",
      "37% discovered. Every location has a story—yours is just starting.",
      "37% progress. The journey is quirky, bold, and all yours.",
      "At 37%, you're steadily paving your own path.",
      "37% done. The adventure is uniquely, unapologetically you.",
      "37% complete. Keep striding—the world awaits your touch!"
    ],
    "38": [
      "38% complete. Your exploration game is getting stronger!",
      "At 38%, each new location is a win in your book.",
      "38% done. The realm is slowly revealing its magic.",
      "38% progress. Every step adds to your epic saga.",
      "38% complete. Your map is turning into a legendary scroll.",
      "38% discovered. Keep exploring—the world is full of surprises.",
      "38% progress. Every percentage point builds your tale.",
      "At 38%, you're inching closer to epic status.",
      "38% done. The journey is as unpredictable as it is exciting.",
      "38% complete. Keep at it; adventure is calling your name."
    ],
    "39": [
      "39% complete. Almost 40% done—your journey is in full swing!",
      "At 39%, every discovered spot is a step toward greatness.",
      "39% done. The map is gradually revealing your legacy.",
      "39% progress. Keep pushing; each percentage counts.",
      "39% complete. Your exploration is as bold as it is quirky.",
      "39% discovered. The world is noticing your persistent strides.",
      "39% progress. Every step you take builds your legend.",
      "At 39%, you’re on a path of epic discovery.",
      "39% done. Keep exploring—the adventure never quits.",
      "39% complete. Your map is a testament to your efforts."
    ],
    "40": [
      "40% complete. A solid milestone—you're 2/5 of the way there!",
      "At 40%, your journey is turning into an epic saga.",
      "40% done. Every location adds a verse to your story.",
      "40% progress. The map is beginning to mirror your adventures.",
      "40% complete. Keep at it; you’re halfway to a small victory.",
      "40% discovered. The realm is slowly succumbing to your exploration.",
      "40% progress. Every new spot is a trophy of your wanderlust.",
      "At 40%, you're making bold strides in Skyrim.",
      "40% done. The adventure is growing with every step.",
      "40% complete. Your journey is a masterpiece in progress."
    ],
    "41": [
      "41% complete. A little over 40% and still charging ahead!",
      "At 41%, every new location fuels your growing legend.",
      "41% done. Your map is becoming a chronicle of your feats.",
      "41% progress. Keep exploring—the world is full of wonders.",
      "41% complete. Every percentage point is a victory lap.",
      "41% discovered. Your adventure is as bold as it is quirky.",
      "41% progress. The realm is slowly bowing to your pace.",
      "At 41%, you're steadily scripting your epic tale.",
      "41% done. Keep moving; your journey is just heating up.",
      "41% complete. Every step brings you closer to mythic status."
    ],
    "42": [
      "42% complete. The answer to life, the universe, and your map!",
      "At 42%, you're clearly not here for a short stroll.",
      "42% done. Every location is a nod to your persistence.",
      "42% progress. Keep it up; your legend is getting cosmic.",
      "42% complete. The realm is slowly succumbing to your charm.",
      "42% discovered. Every step is a quirky victory in Skyrim.",
      "42% progress. Your adventure is as deep as it is fun.",
      "At 42%, you're the hero this map deserves.",
      "42% done. Keep exploring—the journey is anything but ordinary.",
      "42% complete. Your path is filled with curious discoveries."
    ],
    "43": [
      "43% complete. Every new spot adds flavor to your epic tale!",
      "At 43%, your map is beginning to tell a vibrant story.",
      "43% done. Keep it up; the realm is noticing your efforts.",
      "43% progress. Every percentage point builds your legend.",
      "43% complete. Your adventure is both quirky and brave.",
      "43% discovered. The world is slowly opening its secrets to you.",
      "43% progress. Even a small step is a step toward greatness.",
      "At 43%, you’re steadily paving the way to epic wins.",
      "43% done. The map is turning into your personal canvas.",
      "43% complete. Keep exploring; the adventure is far from over."
    ],
    "44": [
      "44% complete. Nearly half your adventure is down—nice work!",
      "At 44%, every new location cements your legend.",
      "44% done. The realm is slowly bending to your will.",
      "44% progress. Keep at it; each step is a triumph.",
      "44% complete. Your map is a work of art in progress.",
      "44% discovered. The world is getting to know you better.",
      "44% progress. Every percentage point is a victory in disguise.",
      "At 44%, you're making your mark, one location at a time.",
      "44% done. The journey is as quirky as it is epic.",
      "44% complete. Keep exploring—greatness is on the horizon."
    ],
    "45": [
      "45% complete. Almost halfway there—impressive progress!",
      "At 45%, your map is getting a serious upgrade.",
      "45% done. Every new spot is another feather in your cap.",
      "45% progress. Keep pushing; your adventure is heating up.",
      "45% complete. The realm is starting to echo your name.",
      "45% discovered. Your journey is a mix of quirky and bold.",
      "45% progress. Even nearly half the map is no small feat.",
      "At 45%, you’re proving that persistence pays off.",
      "45% done. Every step is a victory on your epic quest.",
      "45% complete. Keep striding; the world is waiting for more."
    ],
    "46": [
      "46% complete. Your adventure’s pace is steadily climbing!",
      "At 46%, every new discovery adds to your epic saga.",
      "46% done. The realm is slowly embracing your legend.",
      "46% progress. Keep it up; each location is a victory.",
      "46% complete. Your map is filling with bold stories.",
      "46% discovered. Every step you take turns into a mini triumph.",
      "46% progress. Even the smallest strides build legends.",
      "At 46%, you’re steadily marking your path through Skyrim.",
      "46% done. Your exploration is uniquely inspiring.",
      "46% complete. Keep exploring—greatness is just ahead."
    ],
    "47": [
      "47% complete. Nearly half the map is in your grasp!",
      "At 47%, every location is another step toward epic glory.",
      "47% done. Your journey is building momentum.",
      "47% progress. Keep it up; the realm is listening.",
      "47% complete. Your map tells a story of persistence and flair.",
      "47% discovered. Every step writes a line in your epic.",
      "47% progress. You're steadily carving your niche in Skyrim.",
      "At 47%, your legend is slowly coming into focus.",
      "47% done. Every discovered spot is a badge of honor.",
      "47% complete. Keep pushing—epic adventures await."
    ],
    "48": [
      "48% complete. Almost at the halfway mark—nice and steady!",
      "At 48%, every new location adds to your growing saga.",
      "48% done. The realm is slowly coming to know your name.",
      "48% progress. Keep at it; every percentage point is epic.",
      "48% complete. Your map is transforming into a legend.",
      "48% discovered. Every step is a step toward greatness.",
      "48% progress. Even nearly half the map is a win in your book.",
      "At 48%, you’re steadily advancing into the annals of Skyrim.",
      "48% done. The adventure is as real as it is quirky.",
      "48% complete. Keep exploring; you're almost there."
    ],
    "49": [
      "49% complete. Just one percent shy of half—keep it up!",
      "At 49%, your journey is almost at a turning point.",
      "49% done. Every new spot adds to your epic map.",
      "49% progress. The realm is taking note of your efforts.",
      "49% complete. Your adventure is reaching a pivotal moment.",
      "49% discovered. Every percentage point builds your legacy.",
      "49% progress. You're nearly halfway to total exploration.",
      "At 49%, the map is almost yours—don’t stop now!",
      "49% done. Keep stepping; the finish line is near.",
      "49% complete. Every step is a triumph on your quest."
    ],
    "50": [
      "50% complete. Halfway there—time to celebrate your progress!",
      "At 50%, you're officially a seasoned explorer.",
      "50% done. Every location now feels like a well-earned trophy.",
      "50% progress. The realm is impressed by your persistence.",
      "50% complete. Your map is now a testament to your efforts.",
      "50% discovered. Keep going; the adventure only gets better.",
      "50% progress. You’re halfway to legendary status.",
      "At 50%, your journey is as epic as it is real.",
      "50% done. Every step forward is a win—no matter how small.",
      "50% complete. Half the world is yours; keep conquering the rest!"
    ],
    "51": [
      "51% complete. Over half the map now—nice hustle!",
      "At 51%, every new spot is a victory in your epic journey.",
      "51% done. Your map is filling with bold new tales.",
      "51% progress. The realm is slowly succumbing to your charm.",
      "51% complete. Keep exploring; your legend is in full swing.",
      "51% discovered. Every step is a brushstroke on your masterpiece.",
      "51% progress. You’re making history one location at a time.",
      "At 51%, your adventure is turning into an epic saga.",
      "51% done. The map reflects your tireless spirit.",
      "51% complete. Every percentage point is a win."
    ],
    "52": [
      "52% complete. Over half and still charging ahead!",
      "At 52%, each location adds a spark to your legend.",
      "52% done. Your map is becoming a canvas of epic moments.",
      "52% progress. Keep pushing—the realm is wide open.",
      "52% complete. Every new spot cements your heroic status.",
      "52% discovered. Your adventure is gaining serious momentum.",
      "52% progress. Every percentage point is a step toward glory.",
      "At 52%, your journey is as daring as it is determined.",
      "52% done. The world is slowly falling under your influence.",
      "52% complete. Keep exploring; epic tales await."
    ],
    "53": [
      "53% complete. Every new discovery makes your legend richer!",
      "At 53%, your map is practically bursting with stories.",
      "53% done. Keep it up; every location counts.",
      "53% progress. The realm is slowly bowing to your efforts.",
      "53% complete. Your adventure is an ever-growing saga.",
      "53% discovered. Every step is a victory lap in your journey.",
      "53% progress. You’re steadily making your mark on Skyrim.",
      "At 53%, every percentage point is a celebration.",
      "53% done. The map is turning into your personal epic.",
      "53% complete. Keep the momentum—greatness is near."
    ],
    "54": [
      "54% complete. Over half the adventure is behind you!",
      "At 54%, each new location adds to your epic journey.",
      "54% done. Your map is starting to tell a legendary tale.",
      "54% progress. Keep exploring—the realm is vast and waiting.",
      "54% complete. Every discovered spot is a step toward immortality.",
      "54% discovered. Your adventure is getting more impressive by the minute.",
      "54% progress. Even small wins add up to epic victories.",
      "At 54%, your journey is a mix of grit and glory.",
      "54% done. The world is slowly being claimed by your legend.",
      "54% complete. Keep venturing—every percentage matters."
    ],
    "55": [
      "55% complete. Just past the halfway mark—nice work!",
      "At 55%, your map is practically a work of art.",
      "55% done. Every location is a victory on your path.",
      "55% progress. The realm is slowly succumbing to your charm.",
      "55% complete. Your adventure is more epic with every step.",
      "55% discovered. Keep going; the journey is truly yours.",
      "55% progress. Every percentage point is a badge of honor.",
      "At 55%, you’re crafting your legend one step at a time.",
      "55% done. The map is a reflection of your bold spirit.",
      "55% complete. Keep exploring—the realm awaits your triumph."
    ],
    "56": [
      "56% complete. More than half the journey is in the bag!",
      "At 56%, every discovered spot is a step toward epic glory.",
      "56% done. Your map is slowly but surely coming alive.",
      "56% progress. Keep at it; every percentage matters.",
      "56% complete. The realm is taking notice of your exploits.",
      "56% discovered. Your adventure is a tapestry of bold moves.",
      "56% progress. Every step builds your personal legend.",
      "At 56%, you’re well on your way to total domination.",
      "56% done. Keep stepping—each location counts.",
      "56% complete. Your journey is as epic as it is unique."
    ],
    "57": [
      "57% complete. Your journey is picking up serious pace!",
      "At 57%, every location is a victory for your legend.",
      "57% done. The realm is slowly succumbing to your ambition.",
      "57% progress. Every percentage point writes a line of your epic.",
      "57% complete. Keep exploring—the adventure is real.",
      "57% discovered. Your map is becoming a saga of daring exploits.",
      "57% progress. One step at a time to full-blown heroics.",
      "At 57%, you’re turning the unknown into your playground.",
      "57% done. The realm is watching your every move.",
      "57% complete. Keep it up—the legend grows with you."
    ],
    "58": [
      "58% complete. Nearly 60% done—adventure is heating up!",
      "At 58%, every new spot is a notch on your epic belt.",
      "58% done. Your map is steadily filling with daring tales.",
      "58% progress. Keep exploring—the realm is wide open.",
      "58% complete. Every percentage point adds to your saga.",
      "58% discovered. Your adventure is as bold as it is quirky.",
      "58% progress. One step at a time to total mastery.",
      "At 58%, your journey is a mix of wit and wonder.",
      "58% done. The world is slowly bending to your will.",
      "58% complete. Keep stepping; greatness is just around the corner."
    ],
    "59": [
      "59% complete. Almost 60% done—stay the course!",
      "At 59%, your map is rapidly turning into a legend.",
      "59% done. Every new discovery is a triumph.",
      "59% progress. Keep exploring—the realm is calling.",
      "59% complete. Your adventure is gathering epic momentum.",
      "59% discovered. Every percentage point is a win in your book.",
      "59% progress. Your legend is building with each step.",
      "At 59%, you're on the brink of something great.",
      "59% done. Keep that adventurous spirit alive!",
      "59% complete. The journey is as wild as it is wonderful."
    ],
    "60": [
      "60% complete. A major milestone—you're officially a seasoned explorer!",
      "At 60%, the realm is clearly yours for the taking.",
      "60% done. Every location cements your epic status.",
      "60% progress. The map is now a canvas of your adventures.",
      "60% complete. Keep pushing—the finish line is in sight.",
      "60% discovered. Your journey is a testament to bold exploration.",
      "60% progress. Even the dragons are taking notice.",
      "At 60%, your legend is blazing a trail across Skyrim.",
      "60% done. Every step is a victory in your saga.",
      "60% complete. Keep conquering—epic wins are ahead!"
    ],
    "61": [
      "61% complete. Look at you go—beyond half and still on fire!",
      "At 61%, your map is turning into a legendary scroll.",
      "61% done. Every location is a story worth telling.",
      "61% progress. Keep exploring; the realm is falling for you.",
      "61% complete. Your journey is both daring and delightful.",
      "61% discovered. Every step adds a chapter to your epic.",
      "61% progress. You're steadily crafting your own saga.",
      "At 61%, your adventure is as bold as it is brilliant.",
      "61% done. Keep the momentum—legend status is near.",
      "61% complete. Every percentage point is a win."
    ],
    "62": [
      "62% complete. Over half the map and still charging ahead!",
      "At 62%, every new location is a triumph in your quest.",
      "62% done. Your map is rapidly filling with epic stories.",
      "62% progress. Keep at it; each step builds your legend.",
      "62% complete. Your adventure is a blend of wit and wonder.",
      "62% discovered. Every percentage point is a badge of honor.",
      "62% progress. The realm is slowly bending to your will.",
      "At 62%, your journey is unstoppable.",
      "62% done. Keep exploring—the epic awaits.",
      "62% complete. Your map is your personal legend in the making."
    ],
    "63": [
      "63% complete. Your journey is a blazing path to legend!",
      "At 63%, every location adds to your epic tale.",
      "63% done. The realm is slowly succumbing to your exploration.",
      "63% progress. Keep it up—your map is turning legendary.",
      "63% complete. Every discovered spot is a notch in your belt.",
      "63% discovered. Your adventure is as quirky as it is bold.",
      "63% progress. One step at a time, one epic moment at a time.",
      "At 63%, you’re crafting a story worth singing about.",
      "63% done. The world is noticing your persistent steps.",
      "63% complete. Keep forging ahead—greatness is near."
    ],
    "64": [
      "64% complete. Nearly two-thirds of the journey is yours!",
      "At 64%, every location is a brushstroke in your epic portrait.",
      "64% done. The map is gradually reflecting your legendary strides.",
      "64% progress. Keep exploring; the realm is wide open.",
      "64% complete. Your adventure is filled with bold discoveries.",
      "64% discovered. Every percentage point is a victory in disguise.",
      "64% progress. You're steadily paving your way to greatness.",
      "At 64%, your journey is both daring and determined.",
      "64% done. The map is your canvas—keep painting epic tales.",
      "64% complete. Keep stepping; every discovery counts."
    ],
    "65": [
      "65% complete. Over half the realm is now in your story!",
      "At 65%, your map is starting to look truly epic.",
      "65% done. Every location is a testament to your persistence.",
      "65% progress. Keep exploring; your legend is coming alive.",
      "65% complete. Your adventure is boldly etching itself in history.",
      "65% discovered. Every step adds a line to your saga.",
      "65% progress. You're well on your way to epic status.",
      "At 65%, the realm is slowly succumbing to your bold strides.",
      "65% done. Keep pushing—the end is in sight.",
      "65% complete. Your map is a chronicle of your fearless journey."
    ],
    "66": [
      "66% complete. Two-thirds of the map is now yours to command!",
      "At 66%, every discovered spot is a stroke of genius.",
      "66% done. Your journey is as bold as it is brilliant.",
      "66% progress. Keep it up; your legend grows with each step.",
      "66% complete. The realm is taking notice of your epic quest.",
      "66% discovered. Every percentage point is a win in your book.",
      "66% progress. You're steadily turning the unknown into epic lore.",
      "At 66%, your map is a living testament to your courage.",
      "66% done. Keep exploring—adventure never sleeps.",
      "66% complete. Your saga is as quirky as it is courageous."
    ],
    "67": [
      "67% complete. Your map is getting more epic by the minute!",
      "At 67%, every location is a victory in your quest.",
      "67% done. The realm is slowly being claimed by your legend.",
      "67% progress. Keep pushing—each new spot is a triumph.",
      "67% complete. Your adventure is as grand as it is quirky.",
      "67% discovered. Every step writes a new line in your epic.",
      "67% progress. You're steadily transforming the map into lore.",
      "At 67%, your journey is blazing a trail of adventure.",
      "67% done. Keep moving—the realm awaits your next move.",
      "67% complete. Your legacy is being built one location at a time."
    ],
    "68": [
      "68% complete. Almost 70% done—your journey is in full swing!",
      "At 68%, your map is a patchwork of epic discoveries.",
      "68% done. Every new spot is a victory on your path.",
      "68% progress. Keep exploring—the realm is vast and wild.",
      "68% complete. Your adventure is steadily filling with bold moments.",
      "68% discovered. Every percentage point builds your legend.",
      "68% progress. The map is slowly coming to life with your strides.",
      "At 68%, your journey is a blend of wit and wonder.",
      "68% done. Keep pushing—epic tales are waiting.",
      "68% complete. Your legend grows with every discovered spot."
    ],
    "69": [
      "69% complete. Nearly 70% done—look at you go!",
      "At 69%, every location is another step toward total epicness.",
      "69% done. Your map is quickly turning into a saga.",
      "69% progress. Keep at it—the realm is yours to conquer.",
      "69% complete. Every step adds to your legendary status.",
      "69% discovered. Your adventure is as quirky as it is bold.",
      "69% progress. Even the dragons are taking notice of you.",
      "At 69%, your journey is as wild as it is wondrous.",
      "69% done. Keep exploring—the epic finale is near.",
      "69% complete. Your map is a testament to your persistent spirit."
    ],
    "70": [
      "70% complete. A solid 70%—you're truly on fire!",
      "At 70%, your map is nearly bursting with epic moments.",
      "70% done. Every new location cements your heroic status.",
      "70% progress. Keep exploring; the realm is in awe of you.",
      "70% complete. Your adventure is a full-blown saga in progress.",
      "70% discovered. Every percentage point is a badge of honor.",
      "70% progress. You're well on your way to total domination.",
      "At 70%, your journey is as bold as it is brilliant.",
      "70% done. The map reflects your fearless spirit.",
      "70% complete. Keep charging ahead—epic wins are inevitable."
    ],
    "71": [
      "71% complete. Over 70% done—your legend is blazing!",
      "At 71%, every location is a new verse in your epic ballad.",
      "71% done. Your map is steadily transforming into lore.",
      "71% progress. Keep it up; the realm is slowly bending to your will.",
      "71% complete. Your adventure is as daring as it is memorable.",
      "71% discovered. Every step adds depth to your epic saga.",
      "71% progress. You're steadily scripting your legend.",
      "At 71%, your journey is an inspiring tale of persistence.",
      "71% done. Keep exploring—the final chapters are near.",
      "71% complete. Your map is a chronicle of bold exploits."
    ],
    "72": [
      "72% complete. Nearly three-quarters of your journey is done!",
      "At 72%, your map is a vivid tapestry of epic discoveries.",
      "72% done. Every new spot tells a part of your legend.",
      "72% progress. Keep pushing; the realm is in awe of your strides.",
      "72% complete. Your adventure is a masterpiece in progress.",
      "72% discovered. Every percentage point is a triumph.",
      "72% progress. The map is slowly succumbing to your epic saga.",
      "At 72%, your journey is both bold and brilliant.",
      "72% done. Keep stepping—each location matters.",
      "72% complete. Your legend grows with every discovered spot."
    ],
    "73": [
      "73% complete. Every new location is a page in your epic tale!",
      "At 73%, your map is starting to look like a legendary scroll.",
      "73% done. Keep exploring—each step builds your story.",
      "73% progress. The realm is slowly echoing your legend.",
      "73% complete. Your adventure is as quirky as it is courageous.",
      "73% discovered. Every percentage point is a victory in your saga.",
      "73% progress. Your map is a living testament to bold exploration.",
      "At 73%, your journey is crafting a legacy of epic proportions.",
      "73% done. Keep moving—the realm awaits your next triumph.",
      "73% complete. Every step writes another line in your epic."
    ],
    "74": [
      "74% complete. Nearly three-quarters of the map is in your grasp!",
      "At 74%, every discovered spot is another stroke of epic brilliance.",
      "74% done. Your adventure is steadily turning into legend.",
      "74% progress. Keep exploring; the realm is wide and wild.",
      "74% complete. Your map is a mosaic of daring exploits.",
      "74% discovered. Every step adds a jewel to your crown of adventure.",
      "74% progress. You're crafting a saga that even dragons admire.",
      "At 74%, your journey is as bold as it is brilliant.",
      "74% done. Keep stepping—the final stretch is near.",
      "74% complete. Your legend continues to grow with every move."
    ],
    "75": [
      "75% complete. Three-quarters of the map is now conquered—impressive!",
      "At 75%, your adventure is reaching epic proportions.",
      "75% done. Every location adds to your renowned legacy.",
      "75% progress. Keep it up; you're nearing the pinnacle of exploration.",
      "75% complete. Your map is a chronicle of courageous quests.",
      "75% discovered. Every step makes your legend richer.",
      "75% progress. You're almost at the final stretch—stay bold!",
      "At 75%, your journey is a mix of grit, wit, and epic wins.",
      "75% done. The realm is proud of your relentless spirit.",
      "75% complete. Keep conquering—legendary status is within reach."
    ],
    "76": [
      "76% complete. Over three-quarters done—your legend shines bright!",
      "At 76%, every new location is a nod to your bold exploration.",
      "76% done. Your map is steadily becoming a saga of epic feats.",
      "76% progress. Keep exploring; the realm is taking notice.",
      "76% complete. Your adventure is a true tapestry of daring exploits.",
      "76% discovered. Every percentage point is a victory in your epic.",
      "76% progress. You're steadily marching toward ultimate glory.",
      "At 76%, your journey is both inspiring and epic.",
      "76% done. The map is a canvas of your heroic strides.",
      "76% complete. Keep pushing—the final chapters are almost written."
    ],
    "77": [
      "77% complete. Every new location cements your epic saga!",
      "At 77%, your map is practically a legend in the making.",
      "77% done. Keep exploring—the realm is awed by your progress.",
      "77% progress. Every step is a move toward total epicness.",
      "77% complete. Your adventure is turning into an unforgettable tale.",
      "77% discovered. Every percentage point is a mark of your grit.",
      "77% progress. You're steadily writing your own epic.",
      "At 77%, your journey is both quirky and courageous.",
      "77% done. Keep at it—epic legends are built on persistence.",
      "77% complete. Your map is your personal chronicle of bravery."
    ],
    "78": [
      "78% complete. Nearly 80% of your journey is complete—fantastic!",
      "At 78%, your map is a vibrant mosaic of epic adventures.",
      "78% done. Every discovered spot writes another epic line.",
      "78% progress. Keep exploring; the realm is unfolding for you.",
      "78% complete. Your adventure is as dynamic as it is daring.",
      "78% discovered. Every step is a victory in your ongoing saga.",
      "78% progress. You're steadily turning the unknown into lore.",
      "At 78%, your journey is on fire—keep that momentum!",
      "78% done. The map reflects your relentless spirit.",
      "78% complete. Keep conquering—epic triumphs are ahead."
    ],
    "79": [
      "79% complete. Almost 80%—you're on the brink of epic!",
      "At 79%, every location is a victory in your growing legend.",
      "79% done. Your map is quickly becoming a chronicle of daring deeds.",
      "79% progress. Keep pushing—the realm is in awe of you.",
      "79% complete. Your adventure is as bold as it is brilliant.",
      "79% discovered. Every percentage point is a win in your quest.",
      "79% progress. You're steadily etching your legend into the world.",
      "At 79%, your journey is a captivating tale of courage.",
      "79% done. Keep stepping—the final frontier is near.",
      "79% complete. Your map is a testament to your unwavering spirit."
    ],
    "80": [
      "80% complete. A mighty 80%—your journey is nearly epic!",
      "At 80%, your map is a saga of bold adventures.",
      "80% done. Every location is a jewel in your legendary crown.",
      "80% progress. Keep exploring—the realm is almost entirely yours.",
      "80% complete. Your adventure is a roaring epic in the making.",
      "80% discovered. Every step adds to your heroic story.",
      "80% progress. You're on the verge of total map mastery.",
      "At 80%, your journey is as daring as it is triumphant.",
      "80% done. Keep it up—epic glory is just ahead.",
      "80% complete. The realm celebrates your relentless spirit."
    ],
    "81": [
      "81% complete. Beyond 80%—your legend is shining bright!",
      "At 81%, every new spot reinforces your epic status.",
      "81% done. Your map is a vivid chronicle of daring quests.",
      "81% progress. Keep exploring—the realm is at your feet.",
      "81% complete. Your adventure is a tour de force of epic moments.",
      "81% discovered. Every percentage point marks a heroic win.",
      "81% progress. You're steadily crossing into legend territory.",
      "At 81%, your journey is a symphony of bold exploits.",
      "81% done. Keep venturing—the final stretch beckons.",
      "81% complete. Your map is nearly a masterpiece of exploration."
    ],
    "82": [
      "82% complete. Your map is now a near-complete epic saga!",
      "At 82%, every location is a testament to your fearless spirit.",
      "82% done. Keep exploring—the realm is almost fully revealed.",
      "82% progress. Every discovered spot is a nod to your legend.",
      "82% complete. Your adventure is on the cusp of perfection.",
      "82% discovered. Every step builds your epic chronicle.",
      "82% progress. You're turning the map into your personal lore.",
      "At 82%, your journey is both thrilling and relentless.",
      "82% done. Keep at it—the final pages of your saga are near.",
      "82% complete. Your legend is nearly complete—stay bold!"
    ],
    "83": [
      "83% complete. Every new location shouts your epic story!",
      "At 83%, your map is nearly a full-blown epic.",
      "83% done. Keep exploring—every percentage adds to your myth.",
      "83% progress. The realm is slowly revealing its ultimate secrets.",
      "83% complete. Your adventure is as daring as it is dynamic.",
      "83% discovered. Every step makes your legend that much richer.",
      "83% progress. You're steadily nearing the ultimate triumph.",
      "At 83%, your journey is a blend of wit, grit, and grandeur.",
      "83% done. Keep stepping—epic victory is almost in sight.",
      "83% complete. Your map is almost a masterpiece of adventure."
    ],
    "84": [
      "84% complete. Over four-fifths of your epic journey is done!",
      "At 84%, every location deepens your legendary status.",
      "84% done. Keep exploring—the realm is nearly yours.",
      "84% progress. Your map is a vivid tapestry of daring exploits.",
      "84% complete. Every discovered spot is a win for your saga.",
      "84% discovered. Your adventure is a true odyssey of epic moments.",
      "84% progress. You're steadily stepping into legend status.",
      "At 84%, your journey is as inspiring as it is unstoppable.",
      "84% done. Keep moving—glory is just around the corner.",
      "84% complete. Your map is almost a complete chronicle of bravery."
    ],
    "85": [
      "85% complete. A whopping 85%—your legend is nearly sealed!",
      "At 85%, every new spot is another epic win in your saga.",
      "85% done. Your map is practically a scroll of epic tales.",
      "85% progress. Keep exploring—the realm is giving you a standing ovation.",
      "85% complete. Your adventure is at the brink of mythic status.",
      "85% discovered. Every percentage point is a nod to your courage.",
      "85% progress. You're close to etching your name in legend.",
      "At 85%, your journey is both audacious and awe-inspiring.",
      "85% done. Keep stepping—the final chapter is near.",
      "85% complete. Your map is a testament to your fearless spirit."
    ],
    "86": [
      "86% complete. Over 85% and still blazing trails—impressive!",
      "At 86%, every location brings you closer to epic immortality.",
      "86% done. Your map is nearly a complete chronicle of valor.",
      "86% progress. Keep exploring; the realm is yours for the taking.",
      "86% complete. Your adventure is a symphony of bold exploits.",
      "86% discovered. Every step is a victory in your epic saga.",
      "86% progress. You're steadily writing a legend for the ages.",
      "At 86%, your journey is a roaring ode to adventure.",
      "86% done. Keep moving—glory is just a heartbeat away.",
      "86% complete. Your map is almost a masterpiece of heroic deeds."
    ],
    "87": [
      "87% complete. Your map is nearly bursting with epic discoveries!",
      "At 87%, every new spot is a step toward eternal legend.",
      "87% done. Keep exploring—the realm is in awe of your exploits.",
      "87% progress. Every discovered location sings of your courage.",
      "87% complete. Your adventure is a chronicle of daring triumphs.",
      "87% discovered. Each percentage point is a mark of your epic journey.",
      "87% progress. You're steadily closing in on complete mastery.",
      "At 87%, your journey is as legendary as it is relentless.",
      "87% done. Keep stepping—epic victory is almost at hand.",
      "87% complete. Your map is a vibrant testament to your bold spirit."
    ],
    "88": [
      "88% complete. Almost the end is in sight—88% and counting!",
      "At 88%, every location is a stone in your epic foundation.",
      "88% done. Your map is nearly a full-blown saga.",
      "88% progress. Keep exploring—the realm is almost fully unveiled.",
      "88% complete. Your adventure is reaching its epic crescendo.",
      "88% discovered. Every step is a line in your legendary tale.",
      "88% progress. You're steadily inching toward total map mastery.",
      "At 88%, your journey is an epic in motion.",
      "88% done. Keep moving—each percentage point brings you closer to glory.",
      "88% complete. Your legend is nearly complete—stay adventurous!"
    ],
    "89": [
      "89% complete. Nearly 90%—you’re in the final stretch of epicness!",
      "At 89%, every new location is a victory cry for your legend.",
      "89% done. Your map is almost a complete epic saga.",
      "89% progress. Keep exploring; the realm is almost at your feet.",
      "89% complete. Your adventure is about to hit legendary status.",
      "89% discovered. Every percentage point is a triumph of spirit.",
      "89% progress. You're so close, even the dragons are cheering.",
      "At 89%, your journey is as bold as it is breathtaking.",
      "89% done. Keep stepping—epic glory is nearly yours.",
      "89% complete. Your map is almost a complete tale of bravery."
    ],
    "90": [
      "90% complete. Nearly there, champion—epic finish in sight!",
      "At 90%, your legend is almost fully written.",
      "90% done. The finish line is just around the corner.",
      "90% progress. So close, yet so legendary!",
      "90% complete. Your adventure is almost mythic.",
      "90% discovered. Keep pushing—epic status awaits you.",
      "90% progress. One step away from eternal renown.",
      "At 90%, your journey is nearing its epic climax.",
      "90% done. The realm salutes your relentless spirit.",
      "90% complete. Just a few more steps to legendary glory!"
    ],
    "91": [
      "91% complete. Just a hair’s breadth away from perfection!",
      "At 91%, every new location echoes your epic journey.",
      "91% done. Keep exploring—glory is almost within reach.",
      "91% progress. Your map is nearly a complete masterpiece.",
      "91% complete. The realm is in awe of your near-total conquest.",
      "91% discovered. Every percentage point is a victory lap.",
      "91% progress. You're inches away from becoming a true legend.",
      "At 91%, your journey is a nail-biting epic in progress.",
      "91% done. Keep stepping—ultimate glory is at hand.",
      "91% complete. Your map is almost entirely your own."
    ],
    "92": [
      "92% complete. Nearly there—just a smidge away from total epicness!",
      "At 92%, your map is almost a full epic chronicle.",
      "92% done. Every location is a step closer to immortality.",
      "92% progress. Keep exploring—the realm is nearly entirely yours.",
      "92% complete. Your adventure is a breathtaking near-finale.",
      "92% discovered. Every percentage point screams victory.",
      "92% progress. You're so close, legend status is imminent.",
      "At 92%, your journey is a crescendo of epic moments.",
      "92% done. Keep stepping—epic completion is just ahead.",
      "92% complete. Your map is nearly a saga of heroics."
    ],
    "93": [
      "93% complete. Almost at the finish line—epic almost achieved!",
      "At 93%, every new spot adds to your near-complete saga.",
      "93% done. Keep exploring—legendary status is nearly yours.",
      "93% progress. Your map is a near-perfect epic in the making.",
      "93% complete. The realm is watching your final strides.",
      "93% discovered. Every step is a note in your epic finale.",
      "93% progress. You're on the verge of total mastery.",
      "At 93%, your journey is almost a complete legend.",
      "93% done. Keep moving—just a few more daring steps!",
      "93% complete. Your map is nearly an epic masterpiece."
    ],
    "94": [
      "94% complete. So close to the ultimate win—just 6% left!",
      "At 94%, your map is nearly a flawless saga of adventure.",
      "94% done. Every discovered spot shouts your impending legend.",
      "94% progress. Keep exploring—epic glory is almost at hand.",
      "94% complete. Your adventure is nearing a mythic finale.",
      "94% discovered. Every percentage point is a step toward immortality.",
      "94% progress. You're inches away from epic perfection.",
      "At 94%, your journey is almost a complete masterpiece.",
      "94% done. Keep stepping—glory awaits in just a bit.",
      "94% complete. Your map is almost entirely your own legend."
    ],
    "95": [
      "95% complete. Nearly there—just 5% shy of total mastery!",
      "At 95%, your adventure is almost the stuff of legends.",
      "95% done. Every location cements your epic reputation.",
      "95% progress. Keep exploring—epic triumph is almost yours.",
      "95% complete. Your map is nearly a full-blown saga.",
      "95% discovered. Every percentage point is a testament to your grit.",
      "95% progress. You're so close, even the bards are holding their breath.",
      "At 95%, your journey is a near-perfect epic.",
      "95% done. Keep stepping—legendary glory is in sight.",
      "95% complete. Your map is almost a complete epic of adventure."
    ],
    "96": [
      "96% complete. Almost there—just a whisper away from perfection!",
      "At 96%, your map is nearly a flawless epic chronicle.",
      "96% done. Every discovered spot is a nod to your relentless quest.",
      "96% progress. Keep exploring—the final victory is imminent.",
      "96% complete. Your adventure is nearing mythic proportions.",
      "96% discovered. Every step builds your legendary legacy.",
      "96% progress. You're on the cusp of total map mastery.",
      "At 96%, your journey is almost a complete legend.",
      "96% done. Keep it up—epic triumph is just around the bend.",
      "96% complete. Your map is nearly a masterpiece of heroic deeds."
    ],
    "97": [
      "97% complete. Nearly done—only 3% left to eternal glory!",
      "At 97%, every location is a final piece of your epic puzzle.",
      "97% done. Keep exploring—epic completion is almost here.",
      "97% progress. Your map is almost entirely your legacy.",
      "97% complete. The realm is in awe of your near-total conquest.",
      "97% discovered. Every percentage point is a step into legend.",
      "97% progress. You're just a hair away from total mastery.",
      "At 97%, your journey is nearly a complete epic saga.",
      "97% done. Keep stepping—the final chapter is imminent.",
      "97% complete. Your map is almost a full legend in the making."
    ],
    "98": [
      "98% complete. So close to perfection—just 2% remains!",
      "At 98%, your map is nearly a flawless epic tale.",
      "98% done. Every location screams of your impending triumph.",
      "98% progress. Keep exploring—epic glory is almost yours.",
      "98% complete. Your adventure is nearly a mythic saga.",
      "98% discovered. Every percentage point heralds your ultimate legacy.",
      "98% progress. You're inches away from complete domination.",
      "At 98%, your journey is nearly a masterpiece of legend.",
      "98% done. Keep stepping—total epicness is almost achieved.",
      "98% complete. Your map is nearly entirely your epic saga."
    ],
    "99": [
      "99% complete. Nearly there—epic victory is in sight!",
      "At 99%, every location is a testament to your near-perfection.",
      "99% done. Keep exploring—just a breath away from complete mastery.",
      "99% progress. Your map is almost a flawless epic chronicle.",
      "99% complete. The realm is applauding your almost-mythic journey.",
      "99% discovered. Every step is a near-final stroke of epic brilliance.",
      "99% progress. You're just one step from eternal legend.",
      "At 99%, your journey is a heartbeat away from perfection.",
      "99% done. Keep stepping—epic glory is practically yours.",
      "99% complete. Your map is nearly a complete saga of adventure."
    ],
    "100": [
      "100% complete. You've conquered every corner of Skyrim!",
      "At 100%, you’re officially a legend in Tamriel.",
      "100% done. The map bows to your epic journey.",
      "Complete at 100%. Even the dragons salute you!",
      "100% progress. Your adventure is the stuff of legends.",
      "At 100%, every stone has been turned. Bravo!",
      "100% complete. Skyrim will remember your name.",
      "Complete at 100%. The world is fully explored, hero.",
      "100% done. You've achieved the ultimate explorer status.",
      "At 100%, you've made history in Skyrim. Epic win!"
    ]
  }
}
